{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of62.bin", "group1-shard2of62.bin", "group1-shard3of62.bin", "group1-shard4of62.bin", "group1-shard5of62.bin", "group1-shard6of62.bin", "group1-shard7of62.bin", "group1-shard8of62.bin", "group1-shard9of62.bin", "group1-shard10of62.bin", "group1-shard11of62.bin", "group1-shard12of62.bin", "group1-shard13of62.bin", "group1-shard14of62.bin", "group1-shard15of62.bin", "group1-shard16of62.bin", "group1-shard17of62.bin", "group1-shard18of62.bin", "group1-shard19of62.bin", "group1-shard20of62.bin", "group1-shard21of62.bin", "group1-shard22of62.bin", "group1-shard23of62.bin", "group1-shard24of62.bin", "group1-shard25of62.bin", "group1-shard26of62.bin", "group1-shard27of62.bin", "group1-shard28of62.bin", "group1-shard29of62.bin", "group1-shard30of62.bin", "group1-shard31of62.bin", "group1-shard32of62.bin", "group1-shard33of62.bin", "group1-shard34of62.bin", "group1-shard35of62.bin", "group1-shard36of62.bin", "group1-shard37of62.bin", "group1-shard38of62.bin", "group1-shard39of62.bin", "group1-shard40of62.bin", "group1-shard41of62.bin", "group1-shard42of62.bin", "group1-shard43of62.bin", "group1-shard44of62.bin", "group1-shard45of62.bin", "group1-shard46of62.bin", "group1-shard47of62.bin", "group1-shard48of62.bin", "group1-shard49of62.bin", "group1-shard50of62.bin", "group1-shard51of62.bin", "group1-shard52of62.bin", "group1-shard53of62.bin", "group1-shard54of62.bin", "group1-shard55of62.bin", "group1-shard56of62.bin", "group1-shard57of62.bin", "group1-shard58of62.bin", "group1-shard59of62.bin", "group1-shard60of62.bin", "group1-shard61of62.bin", "group1-shard62of62.bin"], "weights": [{"name": "conv1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/beta", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2a/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "res2a_branch1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch1/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res2b_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2b_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2b_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2b_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2b_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2b_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res2c_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2c_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2c_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2c_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res2c_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2c_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res3a_branch2a/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "res3a_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3a_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3a_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3a_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3a_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "res3a_branch1/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "res3a_branch1/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res3b_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3b_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3b_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3b_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3b_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3b_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res3c_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3c_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3c_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3c_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3c_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3c_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res3d_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3d_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3d_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3d_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "res3d_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3d_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res4a_branch2a/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "res4a_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4a_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4a_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4a_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4a_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "res4a_branch1/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "res4a_branch1/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4b_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4b_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4b_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4b_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4b_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4b_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4c_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4c_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4c_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4c_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4c_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4c_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4d_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4d_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4d_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4d_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4d_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4d_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4e_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4e_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4e_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4e_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4e_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4e_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4f_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4f_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4f_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4f_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4f_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4f_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4g_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4g_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4g_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4g_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4g_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4g_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4g_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4g_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4g_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4g_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4g_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4h_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4h_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4h_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4h_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4h_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4h_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4h_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4h_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4h_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4h_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4h_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4i_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4i_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4i_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4i_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4i_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4i_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4i_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4i_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4i_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4i_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4i_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4j_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4j_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4j_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4j_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4j_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4j_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4j_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4j_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4j_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4j_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4j_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4k_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4k_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4k_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4k_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4k_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4k_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4k_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4k_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4k_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4k_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4k_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4l_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4l_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4l_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4l_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4l_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4l_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4l_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4l_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4l_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4l_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4l_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4m_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4m_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4m_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4m_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4m_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4m_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4m_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4m_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4m_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4m_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4m_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4n_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4n_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4n_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4n_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4n_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4n_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4n_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4n_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4n_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4n_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4n_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4o_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4o_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4o_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4o_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4o_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4o_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4o_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4o_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4o_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4o_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4o_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4p_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4p_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4p_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4p_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4p_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4p_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4p_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4p_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4p_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4p_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4p_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4q_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4q_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4q_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4q_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4q_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4q_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4q_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4q_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4q_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4q_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4q_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4r_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4r_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4r_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4r_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4r_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4r_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4r_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4r_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4r_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4r_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4r_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4s_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4s_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4s_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4s_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4s_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4s_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4s_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4s_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4s_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4s_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4s_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4t_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4t_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4t_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4t_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4t_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4t_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4t_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4t_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4t_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4t_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4t_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4u_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4u_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4u_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4u_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4u_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4u_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4u_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4u_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4u_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4u_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4u_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4v_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4v_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4v_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4v_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4v_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4v_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4v_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4v_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4v_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4v_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4v_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res4w_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4w_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2a/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4w_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4w_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4w_branch2b/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "res4w_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4w_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4w_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4w_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4w_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4w_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "res5a_branch2a/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "res5a_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5a_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5a_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5a_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5a_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "res5a_branch1/kernel", "shape": [1, 1, 1024, 2048], "dtype": "float32"}, {"name": "res5a_branch1/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "res5b_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5b_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5b_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5b_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5b_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5b_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "res5c_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5c_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5c_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5c_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "res5c_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5c_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "fpn_c5p5/kernel", "shape": [1, 1, 2048, 256], "dtype": "float32"}, {"name": "fpn_c5p5/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_c4p4/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "fpn_c4p4/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_c3p3/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "fpn_c3p3/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_c2p2/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "fpn_c2p2/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_p5/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "fpn_p5/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_p2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "fpn_p2/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_p3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "fpn_p3/bias", "shape": [256], "dtype": "float32"}, {"name": "fpn_p4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "fpn_p4/bias", "shape": [256], "dtype": "float32"}, {"name": "rpn_conv_shared/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "rpn_conv_shared/bias", "shape": [512], "dtype": "float32"}, {"name": "rpn_class_raw/kernel", "shape": [1, 1, 512, 6], "dtype": "float32"}, {"name": "rpn_class_raw/bias", "shape": [6], "dtype": "float32"}, {"name": "rpn_bbox_pred/kernel", "shape": [1, 1, 512, 12], "dtype": "float32"}, {"name": "rpn_bbox_pred/bias", "shape": [12], "dtype": "float32"}, {"name": "mrcnn_mask_conv1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "mrcnn_mask_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "mrcnn_mask_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "mrcnn_mask_bn2/gamma", 